## Pandas-tehtävät OSA 2

#### Tehtävä 1. Lue edellisen harjoituksen lopussa tallennetun data_export.csv-tiedoston sisältö dataframeen siten, että Unnamed 0 -saraketta ei synny tiedoston lukemisen yhteydessä.

In [32]:
import pandas as pd

In [33]:
df=pd.read_csv("data_export.csv", index_col=0)
df.head()

    sarake1   sarake2   sarake3
0       NaN  0.380058  0.919389
1  0.922251  0.490721  0.133932
2  0.073746  0.929162  0.962745
3  0.363707  0.878349  0.485700
4  0.106903  0.714651  0.039953

#### Tehtävä 2. Pudota rivit, joissa esiintyy nan-arvo

In [34]:
df_clean=df.dropna(axis=0)
df_clean.head()

    sarake1   sarake2   sarake3
1  0.922251  0.490721  0.133932
2  0.073746  0.929162  0.962745
3  0.363707  0.878349  0.485700
4  0.106903  0.714651  0.039953
5  0.196788  0.232740  0.879700

#### Tehtävä 3. Muuta viidennen ja kymmenennen rivin kaikiksi arvoiksi nan

In [35]:
df_clean_copy=df_clean.copy()
df_clean_copy.head()

    sarake1   sarake2   sarake3
1  0.922251  0.490721  0.133932
2  0.073746  0.929162  0.962745
3  0.363707  0.878349  0.485700
4  0.106903  0.714651  0.039953
5  0.196788  0.232740  0.879700

In [36]:
df_clean_copy.iloc[5, :]="nan"
df_clean_copy.iloc[10,:]="nan"

In [41]:
df_clean_copy.head(50)

#### Tehtävä 4. Tulosta nan-arvojen määrä jokaisesta sarakkeesta DataFrame-objektista

In [44]:
df_clean_copy.isnull().sum(axis=0)

sarake1    0
sarake2    0
sarake3    0
dtype: int64

#### Tehtävä 5. Täytä edellä tehdyt nan-arvot lineaarisella interpolaatiolla

In [322]:
#

#### Tehtävä 6. Vaihda `sarake1`:n viimeiseksi arvoksi 94 ja `sarake3`:n viimeiseksi arvoksi 45

In [323]:
#

#### Tehtävä 7. Lisää uusi sarake DataFrame-objektiin (`sarake4`), joka koostuu sarakkeiden `sarake1` ja `sarake3` summasta

In [324]:
#

#### Tehtävä 8. Resetoi DataFrame-objektin indeksi ja tulosta rivien määrä

In [325]:
#

#### Tehtävä 9. Tee DataFrame-objektin mittainen aikasarjadata haluamallasi aikavälillä ja tee siitä indeksisarake

In [326]:
#

#### Tehtävä 10. Muuta `sarake1` kaikki arvot merkkijonoiksi, joissa jokainen nolla on korvattu isolla 'ND'-kirjainyhdistelmällä.

In [327]:
#

#### Tehtävä 11. Tee DataFrame-objektista kopio, jonka sarakkeiden nimet on muutettu seuraaviksi : `sarake5`, `sarake6`, `sarake7`, `sarake8`. Tämän jälkeen tee yksi iso DataFrame-objekti, joka koostuu alkuperäisestä DataFramesta sekä kopiosta niin, että ne on lisätty vierekkäin.


| sarake1        | sarake2           | sarake3  | sarake4 | sarake5      | sarake6 | sarake7 | sarake8 |
| ------------- |:-------------:| -----:| ------------- |:-------------:| -----:|-----:|-----:|
| 0.1      | 0.2 | 0.3 | ... | ...  | ... | ... | ... |

In [328]:
#

#### Tehtävä 12. Sijoita `sarake5`:n viimeinen arvo muuttujaan sekä `sarake3`:n viimeinen arvo erilliseen muuttujaan juuri tehdystä DataFrame-objektista merkkijonomuodossa. Yhdistä kyseiset muuttujat merkkijonona ja poista kaksi viimeistä merkkiä lopputuloksesta. Lopuksi poista kaikki pisteet `.`.

In [329]:
#